import networkx as nx
import matplotlib.pyplot as plt


def create_metro_graph():
    metro_graph = nx.Graph()
    # Додавання вузлів (станцій)
    stations = [
        "Академмістечко", "Житомирська", "Святошин", "Нивки",
        "Берестейська", "Шулявська", "Політехнічний Інститут", "Вокзальна",
        "Університет", "Театральна", "Хрещатик", "Арсенальна",
        "Дніпро", "Гідропарк", "Лівобережна", "Дарниця", "Чернігівська", "Лісова",
        "Героїв Дніпра", "Мінська", "Оболонь", "Почайна", "Тараса Шевченка", "Контрактова Площа",
        "Поштова Площа", "Майдан Незалежності", "Площа Українських Героїв", "Олімпійська", "Палац Україна",
        "Либідська", "Деміївська", "Голосіївська", "Васильківська", "Виставковий Центр",
        "Іподром", "Теремки", "Сирець", "Дорогожичі", "Золоті Ворота", "Палац Спорту", "Кловська", "Печерська",
        "Звіринецька", "Видубичі", "Славутич", "Осокорки", "Позняки", "Харківська", "Вирлиця",
        "Бориспільська", "Червоний Хутір"    
    ]

    metro_graph.add_nodes_from(stations)

    # Додавання зв'язків (ліній метро)
    metro_lines = [
        ("Академмістечко", "Житомирська"),
        ("Житомирська", "Святошин"),
        ("Святошин", "Нивки"),
        ("Нивки", "Берестейська"),
        ("Берестейська", "Шулявська"),
        ("Шулявська", "Політехнічний Інститут"),
        ("Політехнічний Інститут", "Вокзальна"),
        ("Вокзальна", "Університет"),
        ("Університет", "Театральна"),
        ("Театральна", "Хрещатик"),
        ("Хрещатик", "Арсенальна"),
        ("Арсенальна", "Дніпро"),
        ("Дніпро", "Гідропарк"),
        ("Гідропарк", "Лівобережна"),
        ("Лівобережна", "Дарниця"),
        ("Дарниця", "Чернігівська"),
        ("Чернігівська", "Лісова"),
        ("Героїв Дніпра", "Мінська"),
        ("Мінська", "Оболонь"),
        ("Оболонь", "Почайна"),
        ("Почайна", "Тараса Шевченка"),
        ("Тараса Шевченка", "Контрактова Площа"),
        ("Контрактова Площа", "Поштова Площа"),
        ("Поштова Площа", "Майдан Незалежності"),
        ("Майдан Незалежності", "Площа Українських Героїв"),
        ("Площа Українських Героїв", "Олімпійська"),
        ("Олімпійська", "Палац Україна"),
        ("Палац Україна", "Либідська"),
        ("Либідська", "Деміївська"),
        ("Деміївська", "Голосіївська"),
        ("Голосіївська", "Васильківська"),
        ("Васильківська", "Виставковий Центр"),
        ("Виставковий Центр", "Іподром"),
        ("Іподром", "Теремки"),
        ("Майдан Незалежності", "Хрещатик"),
        ("Золоті Ворота", "Театральна"),
        ("Площа Українських Героїв", "Палац Спорту"),
        ("Сирець", "Дорогожичі"),
        ("Дорогожичі", "Золоті Ворота"),
        ("Золоті Ворота", "Палац Спорту"),
        ("Палац Спорту", "Кловська"),
        ("Кловська", "Печерська"),
        ("Печерська", "Звіринецька"),
        ("Звіринецька", "Видубичі"),
        ("Видубичі", "Славутич"),
        ("Славутич", "Осокорки"),
        ("Осокорки", "Позняки"),
        ("Позняки", "Харківська"),
        ("Харківська", "Вирлиця"),
        ("Вирлиця", "Бориспільська"),
        ("Бориспільська", "Червоний Хутір")
    ]

    metro_graph.add_edges_from(metro_lines)


    for edge in metro_lines:
        weight = 1  
        metro_graph.add_edge(edge[0], edge[1], weight=weight)

    # Визначення позицій вузлів
    node_positions = {
        "Академмістечко": (-50, 7),
        "Житомирська": (-49, 6),
        "Святошин": (-48, 5),
        "Нивки": (-47, 4),
        "Берестейська": (-46, 3),
        "Шулявська": (-45, 2),
        "Політехнічний Інститут": (-44, 1),
        "Вокзальна": (-43, 0),
        "Університет": (-40, 0),
        "Театральна": (-36, 0),
        "Золоті Ворота": (-36, 0.5),
        "Палац Спорту": (-32, -0.5),
        "Печерська": (-29, -3),
        "Кловська": (-29, -2),
        "Звіринецька": (-29, -4),
        "Видубичі": (-26, -5),
        "Славутич": (-23, -6),
        "Осокорки": (-20, -7),
        "Позняки": (-17, -8),
        "Харківська": (-14, -8.5),
        "Вирлиця": (-11, -7),
        "Бориспільська": (-8, -6),
        "Хрещатик": (-28, 0),
        "Арсенальна": (-25, -1),
        "Дніпро": (-23, -2),
        "Гідропарк": (-21, -3),
        "Лівобережна": (-19, -2),
        "Дарниця": (-17, -1),
        "Чернігівська": (-15, 0),
        "Оболонь": (-28, 1),
        "Почайна": (-28, 1.5),
        "Тараса Шевченка": (-28, 2),
        "Контрактова Площа": (-28, 2),
        "Поштова Площа": (-28, 2),
        "Майдан Незалежності": (-28, 2),
        "Площа Українських Героїв": (-30, -0.7),
        "Олімпійська": (0, 1),
        "Либідська": (0, 0),
        "Деміївська": (0, -0.5),
        "Голосіївська": (0, -1),
        "Васильківська": (0, -1.5),
        "Виставковий Центр": (0, -2),
        "Іподром": (-0.5, -2),
        "Теремки": (-1, -2),
        "Сирець": (-42, 5),
        "Дорогожичі": (-41, 4),
        "Героїв Дніпра": (-28, 8),
        "Мінська": (-28, 7),
        "Лісова": (-13, 1),
        "Теремки": (-2, -2),
        "Червоний Хутір": (-5, -5),
        "Оболонь": (-28, 6),
        "Почайна": (-28, 5),
        "Тараса Шевченка": (-28, 4),
        "Контрактова Площа": (-28, 3),
        "Поштова Площа": (-28, 2),
        "Майдан Незалежності": (-28, 1),
        "Олімпійська": (-36, -2),
        "Палац Україна": (-36, -3),
        "Либідська": (-36, -4),
        "Деміївська": (-39, -5),
        "Голосіївська": (-42, -6),
        "Васильківська": (-45, -7),
        "Виставковий Центр": (-48, -8),
        "Іподром": (-51, -9),
        "Теремки": (-54, -9)
    }

    # Оновлення позицій вузлів
    for station in metro_graph.nodes:
        pos = node_positions.get(station, None)
        if pos is not None:
            metro_graph.nodes[station]["pos"] = pos

    edge_labels = {(edge[0], edge[1]): metro_graph[edge[0]][edge[1]]['weight'] for edge in metro_lines}

    pos = nx.get_node_attributes(metro_graph, 'pos')
    plt.figure(figsize=(10, 8))
    nx.draw(metro_graph, pos, with_labels=True, font_weight='bold', node_size=700, node_color='skyblue', font_size=8)

    # Додавання ваг ребер
    nx.draw_networkx_edge_labels(metro_graph, pos, edge_labels=edge_labels, font_color='red', font_size=8)

    plt.title(metro_graph)

    plt.show()

    return metro_graph

    
